Revit 2026 API

# LabelUtilsGetLabelForUnit Method

---

Gets the user-visible name for a unit.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string GetLabelForUnit(
	ForgeTypeId unitTypeId
)
```
```vb
Public Shared Function GetLabelForUnit (
	unitTypeId As ForgeTypeId
) As String
```
```cpp
public:
static String^ GetLabelForUnit(
	ForgeTypeId^ unitTypeId
)
```
```fsharp
static member GetLabelForUnit :
        unitTypeId : ForgeTypeId -> string
```

#### Parameters

unitTypeId ForgeTypeId
     Identifier of the unit to get the user-visible name.

#### Return Value

String Returns the user-visible name for a unit.

| Exception | Condition |
| --- | --- |
| ArgumentException | Cannot find DisplayUnitTypeInfo for the given unit identifier. |
| ArgumentNullException | A non-optional argument was null |

The name is obtained in the current Revit language.

#### Reference

LabelUtils Class

Autodesk.Revit.DB Namespace